{
  "id": "AshkaBGosh",
  "created": "2025-04-18T14:30:00.000Z",
  "lastUpdated": "2025-04-25T10:15:00.000Z",
  "name": "Ashka B'Gosh",
  "ancestry": "Fetchling",
  "background": "Emissary",
  "class": "Thaumaturge",
  "level": 3,
  "maxHp": 32,
  "currentHp": 32,
  "ac": 19,
  "abilities": {
    "strength": 10,
    "dexterity": 16,
    "constitution": 10,
    "intelligence": 12,
    "wisdom": 12,
    "charisma": 18
  },
  "saves": {
    "fortitude": 7,
    "reflex": 10,
    "will": 8
  },
  "skills": {
    "acrobatics": {
      "proficiency": 1
    },
    "arcana": {
      "proficiency": 1
    },
    "deception": {
      "proficiency": 2
    },
    "diplomacy": {
      "proficiency": 1
    },
    "medicine": {
      "proficiency": 1
    },
    "nature": {
      "proficiency": 1
    },
    "occultism": {
      "proficiency": 1
    },
    "religion": {
      "proficiency": 1
    },
    "stealth": {
      "proficiency": 1
    },
    "survival": {
      "proficiency": 1
    },
    "thievery": {
      "proficiency": 1
    }
  },
  "proficiencies": {
  "weapons": {
    "simple": {
      "proficiency": 1,
      "name": "Trained"
    },
    "martial": {
      "proficiency": 1,
      "name": "Trained"
    },
    "advanced": {
      "proficiency": 0,
      "name": "Untrained"
    },
    "unarmed": {
      "proficiency": 1,
      "name": "Trained"
    }
  },
  "armor": {
    "unarmored": {
      "proficiency": 1,
      "name": "Trained"
    },
    "light": {
      "proficiency": 1,
      "name": "Trained"
    },
    "medium": {
      "proficiency": 1,
      "name": "Trained"
    },
    "heavy": {
      "proficiency": 0,
      "name": "Untrained"
    }
  }
},
  "feats": [
    {
      "id": "feat-1",
      "name": "Ranger Dedication",
      "level": 2,
      "source": "Archetype",
      "description": "You become trained in Survival; if you were already trained in Survival, you instead become trained in another skill of your choice. You become trained in ranger class DC. You can use the Hunt Prey action.",
      "actions":[
        {
          "name": "Hunt Prey",
          "actionCount": 1,
          "traits": ["Concentrate", "Ranger"],
          "description": "You designate a single creature as your prey and focus your attacks against that creature. You gain a +2 circumstance bonus to Perception checks when you Seek your prey and a +2 circumstance bonus to Survival checks when you Track your prey.\n\nYou also ignore the penalty for making ranged attacks within your second range increment against the prey you're hunting.\n\nYou can have only one creature designated as your prey at a time. This designation lasts until your next daily preparations."
        }
      ]
    },
    {
      "id": "feat-2",
      "name": "Hard to Fool",
      "level": 1,
      "source": "Fetchling",
      "description": "Your experiences in the Shadow Plane have made you wary of deception. You gain a +1 circumstance bonus to Perception checks against illusions and to Will saves against illusions and lies (such as a successful Lie action)."
    },
    {
      "id": "feat-3",
      "name": "Bargain Hunter",
      "level": 1,
      "source": "General",
      "description": "You can Earn Income (page 228) using Diplomacy, spending your days hunting for bargains and reselling at a profit. You can also spend time specifically sniffing out a great bargain on an item; this works as if you were using Earn Income with Diplomacy, except instead of gaining money, you purchase the item at a discount equal to the money you would have gained, gaining the item for free if your earned income equals or exceeds its cost."
    },
    {
      "id": "feat-4",
      "name": "Charming Liar",
      "level": 1,
      "source": "Skill",
      "description": "Your charm allows you to win over those you lie to. When you get a critical success using the Lie action, the target's attitude toward you improves by one step, as though you'd succeeded at using Diplomacy to Make an Impression. This works only once per conversation, and if you critically succeed against multiple targets using the same Lie, you choose one creature's attitude to improve."
    },
    {
      "id": "feat-5",
      "name": "Dubious Knowledge",
      "level": 1,
      "source": "Skill",
      "description": "You're a treasure trove of information, but not all of it comes from reputable sources. When you fail (but don't critically fail) a Recall Knowledge check using any skill, you learn a bit of true knowledge and a bit of erroneous knowledge, but you don't have any way to differentiate which is which."
    },
    {
      "id": "feat-6",
      "name": "Quick Squeeze",
      "level": 1,
      "source": "Skill",
      "description": "You Squeeze 5 feet per round (10 feet on a critical success), rather than 5 feet per minute (10 feet on a critical success)."
    },
    {
      "id": "feat-7",
      "name": "Diverse Lore",
      "level": 2,
      "source": "Thaumaturge",
      "description": "You collect information from a wide variety of sources, letting you use your esoterica lore for a wider range of topics. You can use your esoterica lore to Recall Knowledge about any topic, though you still can't use it in place of a specific lore for a task that requires specialized training, such as Crafting."
    },
    {
      "id": "feat-8",
      "name": "Familiar",
      "level": 1,
      "source": "General",
      "description": "You make a pact with a creature that serves you and assists your spellcasting. You gain a familiar."
    },
    {
      "id": "feat-9",
      "name": "Spell-Signature Reading",
      "level": 1,
      "source": "Skill",
      "description": "Whenever any caster performs magic, no matter how meager, it creates a vibrant display of runes circling around an intricate glyph known as a spell signature. As a learned student of the arcane yourself, you know all too well what information can be gleaned from such runes, such as one's personality or skill level with magic. You learn if the creature is casting the spell as a spontaneous, prepared, or innate spellcaster, if they can cast spells from spell slots, and what attribute they use to cast spells. If a creature can cast a spell from multiple sources such as having innate spells and prepared spells both, you learn both.",
      "actions":[
        {
          "name": "Spell-Signature Reading",
          "actionCount": 1,
          "traits": ["Concentrate", "Secret"],
          "description": "You study the magical energy of a spellcaster you can see within 30 feet. Make a secret Arcana check against the spellcaster's Will DC. On a success, you learn if the creature is casting the spell as a spontaneous, prepared, or innate spellcaster, if they can cast spells from spell slots, and what attribute they use to cast spells. If a creature can cast a spell from multiple sources, you learn both."
        }
      ]
    }
  ],
  "inventory": [
    {
      "id": "item-1",
      "name": "Mother's Amulet",
      "quantity": 1,
      "weight": 0.1,
      "description": "A blood-red ruby set in irridescent metal, the last gift your mother gave you.",
      "reactions": [
        {
          "name": "Amulet's Abeyance",
          "traits": ["Thaumaturge"],
          "trigger": "The target of your Exploit Vulnerability would damage you or an ally within 15 feet of you and you are holding your implement.",
          "description": "You forcefully present your amulet to turn away harm. You or a target ally within 15 feet gain resistance to all damage against the triggering damage. The resistance is equal to 2 + your level."
        }
      ]
    },
    {
      "id": "item-2",
      "name": "Rapier",
      "quantity": 1,
      "weight": 1.0,
      "description": "Piercing damage, finesse, deadly d8"
    },
    {
      "id": "item-3",
      "name": "Leather Armor",
      "quantity": 1,
      "weight": 2.0,
      "description": "Light armor, +2 AC, +4 DEX Cap, -1 Check Penalty"
    },
    {
      "id": "item-4",
      "name": "Adventurer's Pack",
      "quantity": 1,
      "weight": 2.0,
      "description": "Includes backpack, bedroll, 10 pieces of chalk, flint and steel, 50 feet of rope, 2 weeks' rations, soap, 5 torches, and a waterskin"
    },
    {
      "id": "item-5",
      "name": "Scroll of Comprehend Language",
      "quantity": 2,
      "weight": 0.1,
      "description": "Allows comprehension of an unfamiliar language for 1 hour"
    },
    {
      "id": "item-6",
      "name": "Chalice Implement",
      "quantity": 1,
      "weight": 0.5,
      "description": "An obsidian chalice with silver inlaid runes"
    },
    {
      "id": "item-7",
      "name": "Esoteric Tome",
      "quantity": 1,
      "weight": 1.0,
      "description": "Contains notes on various creatures and their weaknesses"
    }
  ],
  "notes": [
    {
      "id": "note-1",
      "title": "Shadow Plane Research",
      "date": "2025-04-10",
      "content": "I've been collecting information about the intersection points between our world and the Shadow Plane. There seems to be a pattern to the locations where the veil is thinnest. Most align with ancient sites of occult significance.",
      "createdAt": "2025-04-10T18:45:00.000Z"
    },
    {
      "id": "note-2",
      "title": "Amulet's Strange Behavior",
      "date": "2025-04-15",
      "content": "My amulet implement has been behaving oddly when near the northern temple ruins. The symbols glow with a faint purple light, and I've noticed shadows cast by it seem to move independently. Could be connected to the strange occurrences the villagers reported.",
      "createdAt": "2025-04-15T21:30:00.000Z"
    }
  ],
  "thaumaturge": {
    "implements": [
      {
        "name": "Amulet",
        "benefit": "You gain an item bonus to saving throws equal to the amulet's implement bonus.",
        "esoterica": "You gain a +1 circumstance bonus to Perception checks to sense magic and to Recall Knowledge about magical subjects."
      },
      {
        "name": "Chalice",
        "benefit": "As an action, you can imbue the chalice with a concoction that you or an adjacent ally can drink. This grants temporary Hit Points equal to your level + your Charisma modifier that last for 10 minutes.",
        "esoterica": "When you succeed at identifying a creature, you learn about any special characteristics of its physiology."
      }
    ],
    "exploits": [
      {
        "name": "Personal Antithesis",
        "description": "You learn how to find and exploit a weakness in a specific creature. When you use Exploit Vulnerability against a creature you've identified with Recall Knowledge, you gain a +2 circumstance bonus to damage rolls against that creature."
      },
      {
        "name": "Shadow Shroud",
        "description": "You can manipulate shadows around yourself, gaining a +1 circumstance bonus to Stealth checks and concealment against creatures more than 30 feet away from you in dim light or darkness."
      }
    ],
    "paradigm": "Cursed",
    "paradigm_description": "You believe that many supernatural effects, including those that creatures create, are curses, whether they manifest as traditional curses, possessions, or simple maledictions. You know that using a creature's personal possessions against them lets you take advantage of the metaphysical connection between creature and possession."
  },
  "actions": [
    {
      "name": "Exploit Vulnerability",
      "actionCount": 1,
      "traits": ["Thaumaturge"],
      "description": "You use your collected lore to identify and target a specific foe's vulnerabilities. Attempt a check to Recall Knowledge about a creature you can see. The DC of this check is determined by the GM but is typically the standard DC to identify a creature of that type - 2. You gain a +1 circumstance bonus on this check if you have successfully identified the creature with a previous Recall Knowledge check during this combat.\n\nIf you succeed, you center your esoterica on that creature in a way that exploits its vulnerabilities, granting you a +1 circumstance bonus to damage rolls against it. The bonus increases to +2 if you have Personal Antithesis."
    }
  ],
  "reactions": [],
  "familiar": {
    "name": "Lazarus",
    "type": "Squox",
    "size": "Tiny",
    "traits": ["Familiar"],
    "ac": 19,
    "hp": 15,
    "speed": "25 feet",
    "skills": ["Stealth", "Acrobatics", "Perception"],
    "communication": "Empathic link with Ashka within 1 mile",
    "abilities": [
      {
        "name": "Manual Dexterity",
        "description": "Your familiar can use up to two of its limbs as if they were hands to use manipulate actions."
      },
      {
        "name": "Threat Display",
        "description": "Your familiar helps you convey wordless threats through body language. Whenever you attempt an Intimidation check to Demoralize a creature, if your familiar is within 30 feet of your target and can act, it accompanies you with snarls, hisses, or raising its hackles. If it can do so, you don't take the normal –4 penalty on the Intimidation check if your target doesn't understand the language you're speaking."
      }
    ],
    "description": "A Squox is an exotic creature resembling a cross between a squirrel and a fox. Little is known about them in Golarion, not even where they are native to; the only clue to their origin is the fact that they can most often be tracked back to Elven traders though where they procure the creatures in the first place remains a mystery."
  }
}