{
  "id": "AshkaBGosh",
  "created": "2025-04-18T14:30:00.000Z",
  "lastUpdated": "2025-04-25T10:15:00.000Z",
  "name": "Ashka B'Gosh",
  "ancestry": "Fetchling",
  "background": "Ranger",
  "class": "Thaumaturge",
  "level": 4,
  "maxHp": 40,
  "ac": 20,
  "size": "Small",
  "speed": 25,
  "senses": "Darkvision",
  "abilities": {
    "strength": 10,
    "dexterity": 16,
    "constitution": 10,
    "intelligence": 12,
    "wisdom": 12,
    "charisma": 18
  },
  "saves": {
    "fortitude": 8,
    "reflex": 11,
    "will": 9
  },
  "skills": {
    "acrobatics": {
      "proficiency": 1
    },
    "arcana": {
      "proficiency": 1
    },
    "deception": {
      "proficiency": 2
    },
    "diplomacy": {
      "proficiency": 1
    },
    "medicine": {
      "proficiency": 1
    },
    "nature": {
      "proficiency": 1
    },
    "occultism": {
      "proficiency": 1
    },
    "religion": {
      "proficiency": 1
    },
    "stealth": {
      "proficiency": 1
    },
    "survival": {
      "proficiency": 1
    },
    "thievery": {
      "proficiency": 1
    }
  },
  "proficiencies": {
  "weapons": {
    "simple": {
      "proficiency": 1,
      "name": "Trained"
    },
    "martial": {
      "proficiency": 1,
      "name": "Trained"
    },
    "advanced": {
      "proficiency": 0,
      "name": "Untrained"
    },
    "unarmed": {
      "proficiency": 1,
      "name": "Trained"
    }
  },
  "armor": {
    "unarmored": {
      "proficiency": 1,
      "name": "Trained"
    },
    "light": {
      "proficiency": 1,
      "name": "Trained"
    },
    "medium": {
      "proficiency": 1,
      "name": "Trained"
    },
    "heavy": {
      "proficiency": 0,
      "name": "Untrained"
    }
  }
},
  "feats": [
    {
      "id": "feat-1",
      "name": "Ranger Dedication",
      "level": 2,
      "source": "Archetype",
      "description": "You become trained in Survival; if you were already trained in Survival, you instead become trained in another skill of your choice. You become trained in ranger class DC. You can use the Hunt Prey action.",
      "actions":[
        {
          "name": "Hunt Prey",
          "actionCount": 1,
          "traits": ["Concentrate", "Ranger"],
          "description": "You designate a single creature as your prey and focus your attacks against that creature. You gain a +2 circumstance bonus to Perception checks when you Seek your prey and a +2 circumstance bonus to Survival checks when you Track your prey.\n\nYou also ignore the penalty for making ranged attacks within your second range increment against the prey you're hunting.\n\nYou can have only one creature designated as your prey at a time. This designation lasts until your next daily preparations."
        }
      ]
    },
    {
      "id": "feat-2",
      "name": "Hard to Fool",
      "level": 1,
      "source": "Fetchling",
      "description": "You're accustomed to seeing through shifting darkness and bewildering magic. You gain a +1 circumstance bonus on Perception checks against illusions as well as to Will saves against illusions and shadow effects."
    },
    {
      "id": "feat-3",
      "name": "Bargain Hunter",
      "level": 1,
      "source": "General",
      "description": "You can Earn Income (page 228) using Diplomacy, spending your days hunting for bargains and reselling at a profit. You can also spend time specifically sniffing out a great bargain on an item; this works as if you were using Earn Income with Diplomacy, except instead of gaining money, you purchase the item at a discount equal to the money you would have gained, gaining the item for free if your earned income equals or exceeds its cost."
    },
    {
      "id": "feat-4",
      "name": "Charming Liar",
      "level": 2,
      "source": "Skill",
      "description": "Your charm allows you to win over those you lie to. When you get a critical success using the Lie action, the target's attitude toward you improves by one step, as though you'd succeeded at using Diplomacy to Make an Impression. This works only once per conversation, and if you critically succeed against multiple targets using the same Lie, you choose one creature's attitude to improve."
    },
    {
      "id": "feat-5",
      "name": "Dubious Knowledge",
      "level": 1,
      "source": "Skill",
      "description": "You're a treasure trove of information, but not all of it comes from reputable sources. When you fail (but don't critically fail) a Recall Knowledge check using any skill, you learn a bit of true knowledge and a bit of erroneous knowledge, but you don't have any way to differentiate which is which."
    },
    {
      "id": "feat-6",
      "name": "Quick Squeeze",
      "level": 1,
      "source": "Skill",
      "description": "You Squeeze 5 feet per round (10 feet on a critical success), rather than 5 feet per minute (10 feet on a critical success)."
    },
    {
      "id": "feat-7",
      "name": "Diverse Lore",
      "level": 2,
      "source": "Thaumaturge",
      "description": "Your wandering studies mean you've heard rumors or theories about almost every topic... though admittedly, your sources aren't always the most reliable. You can take a –2 penalty to your check to Recall Knowledge with Esoteric Lore to Recall Knowledge about any topic, not just the usual topics available for Esoteric Lore. Additionally, when you succeed at your check to Exploit a Vulnerability, compare the result of your Esoteric Lore check to the DC to Recall Knowledge for that creature; if that number would be a success or a critical success, you gain information as if you had succeeded at the Recall Knowledge check."
    },
    {
      "id": "feat-8",
      "name": "Familiar",
      "level": 2,
      "source": "General",
      "description": "You make a pact with a creature that serves you and assists you; you gain a familiar."
    },
    {
      "id": "feat-9",
      "name": "Spell-Signature Reading",
      "level": 3,
      "source": "Skill",
      "description": "Whenever any caster performs magic, no matter how meager, it creates a vibrant display of runes circling around an intricate glyph known as a spell signature. As a learned student of the arcane yourself, you know all too well what information can be gleaned from such runes, such as one's personality or skill level with magic. You learn if the creature is casting the spell as a spontaneous, prepared, or innate spellcaster, if they can cast spells from spell slots, and what attribute they use to cast spells. If a creature can cast a spell from multiple sources such as having innate spells and prepared spells both, you learn both.",
      "actions":[
        {
          "name": "Spell-Signature Reading",
          "actionCount": 1,
          "traits": ["Concentrate", "Secret"],
          "description": "You study the magical energy of a spellcaster you can see within 30 feet. Make a secret Arcana check against the spellcaster's Will DC. On a success, you learn if the creature is casting the spell as a spontaneous, prepared, or innate spellcaster, if they can cast spells from spell slots, and what attribute they use to cast spells. If a creature can cast a spell from multiple sources, you learn both."
        }
      ]
    },
    {
      "id": "feat-10",
      "name": "Scroll Thaumaturgy",
      "level": 4,
      "source": "Thaumaturge",
      "description": "Your multidisciplinary study of magic means you know how to activate the magic in scrolls with ease. You can activate scrolls of any magical tradition, using your Thaumaturge class DC for the resulting spell's DC. When you do, you choose which of its possible traditions to use when you activate it. You can draw and activate scrolls with the same hand holding an implement, much like you can for esoterica."
    },
    {
      "id": "feat-11",
      "name": "Animal Companion",
      "level": 4,
      "source": "Ranger",
      "description": "You gain the service of a young animal companion that travels with you and obeys simple commands. When you Hunt Prey, your animal companion gains the action's benefits."
    },
    {
      "id": "feat-12",
      "name": "Discrete Inquiry",
      "level": 4,
      "source": "General",
      "description": "You are subtle in your efforts to learn the things you need to know. When Gathering Information, you can hide the true subject of your inquiry among other topics of little interest to you without increasing the difficulty of the check or taking more time to Gather Information. Anyone trying to Gather Information to determine if someone else was asking about the topic in question must exceed your Deception DC or the normal DC to Gather Information about your inquiries, whichever is higher, or else they don't learn of your efforts."
    }
  ],
  "inventory": [
    {
      "id": "item-1",
      "name": "Mother's Amulet",
      "traits":["Implement"],
      "quantity": 1,
      "weight": 0.1,
      "description": "A blood-red ruby set in irridescent metal, the last gift your mother gave you.",
      "reactions": [
        {
          "name": "Amulet's Abeyance",
          "traits": ["Thaumaturge"],
          "trigger": "The target of your Exploit Vulnerability would damage you or an ally within 15 feet of you and you are holding your implement.",
          "description": "You forcefully present your amulet to turn away harm. You or a target ally within 15 feet gain resistance to all damage against the triggering damage. The resistance is equal to 2 + your level."
        }
      ]
    },
    {
      "name": "Backpack",
      "price": 0,
      "quantity": 1,
      "weight": 0.1,
      "description": "A backpack for holding your gear",
      "container":{
        "capacity": 4,
        "ignored": 2,
        "contents":[
          {
            "name": "Bedroll",
            "quantity": 1,
            "weight": 0.1,
            "description": "A compact mat, not too comfy but suitable for long journeys."
          },
          {
            "name": "Chalk",
            "quantity": 10,
            "weight": 0.0,
            "description": "Suitable for marking hard surfaces temporarily."
          },
          {
            "name": "Flint & Steel",
            "quantity": 1,
            "weight": 0.0,
            "description": "A camper's classic for starting fires."
          },
          {
            "name": "Rope (50ft)",
            "quantity": 1,
            "weight": 0.1,
            "description": "Sturdy rope for tying something (or someone) down."
          },
          {
            "name": "Rations",
            "quantity": 7,
            "weight": 0.1,
            "description": "While they don't taste amazing, rations offer enough nutrition to keep you from starving. Each pack can feed a single person for a day."
          },
          {
            "name": "Soap",
            "quantity": 1,
            "weight": 0.0,
            "description": "Scrub a dub dub"
          },
          {
            "name": "Torch",
            "quantity": 5,
            "weight": 0.1,
            "description": "A torch sheds bright light in a 20-foot radius (and dim light to the next 20 feet) for 1 hour. It can be used as an improvised weapon that deals 1d4 bludgeoning damage plus 1 fire damage when lit."
          },
          {
            "name": "Waterskin",
            "quantity": 1,
            "weight": 0.1,
            "description": "When it's full, a waterskin contains roughly 1 day's worth of water for a Small or Medium creature."
          }
        ]
      }
    },
    {
      "name": "Crescent Cross",
      "traits": ["Combination", "Critical Fusion", "Disarm", "Parry"],
      "quantity": 1,
      "weight": 0.1,
      "description": "A crescent cross combines a small scizore with an arm-mounted crossbow apparatus that can hold up to three bolts at a time. It changes chambers automatically after you fire. To reload, you must load each bolt into the aparatus individually as its own action.",
      "strikes": [
        {
          "name": "Crescent Cross Bolt",
          "proficiency": "martial",
          "type": "ranged",
          "action": 1,
          "damage": "1d6",
          "range": "30ft",
          "traits": ["Attack", "Capacity 3", "Parry", "Ranged"]
        },
        {
          "name": "Crescent Cross Blade",
          "proficiency": "martial",
          "type": "melee",
          "action": 1,
          "damage": "1d4",
          "traits": ["Attack", "Disarm", "Melee", "Parry"]
        }
      ]
    },
    {
      "name": "Longbow",
      "traits": ["Deadly D10", "Volley 30ft"],
      "quantity": 1,
      "weight": 2.0,
      "description": "This 5-foot-tall bow, usually made of a single piece of elm, hickory, or yew, has a powerful draw and is excellent at propelling arrows with great force and at an extreme distance. You must use two hands to fire a longbow, and it can't be used while mounted. Because it's made for long range, you take a -2 penalty to attacks on creatures within 30ft with it.",
      "strikes": [
        {
          "proficiency": "martial",
          "type": "ranged",
          "action": 1,
          "damage": "1d8",
          "range": "30ft",
          "traits": ["Attack", "Deadly D10", "Ranged", "Volley 30ft"]
        }
      ]
    },
    {
      "name": "Minor Elixir of Life",
      "traits": ["Alchemical", "Consumable", "Elixir", "Healing"],
      "price": 3,
      "quantity": 2,
      "weight": 0.1,
      "description": "Elixirs of life accelerate a living creature's natural healing processes and immune system. Upon drinking this elixir, you regain 1d6 Hit Points and gain a +1 item bonus to saving throws against diseases and poisons for 10 minutes."
    },
    {
      "name": "Skeleton Key",
      "traits": ["Magical"],
      "quantity": 1,
      "weight": 0,
      "description": "A grinning skull tops the bow of this macabre key. This key can be used in place of a thieves' toolkit when attempting to Pick a Lock, and it grants a +1 item bonus to the Thievery check. If the skeleton key becomes broken due to a critical failure on the check, it works as a normal thieves' toolkit and loses its benefits until repaired.",
      "freeActions":[
        {
          "name": "Loosen Lock",
          "traits": [ "Manipulate"],
          "description": "Once per day, the key casts Knock on a Lock you're trying to pick, granting a +4 status bonus to attempts to pick it."
        }
      ],
      "secret": {
        "name": "Shrieking Key",
        "traits": ["Rare", "Cursed", "Magical", "Transmutation"],
        "quantity": 1,
        "weight": 0,
        "description": "A skull-topped metal shrieking key appears to be a skeleton key, useful in place of thieves' tools when attempting to Pick a Lock. A shrieking key has no activation, however. When you use it to Pick a Lock, the key emits a loud shriek audible for 500 feet despite ambient noise. Physical barriers still block or muffle the shriek as normal. You also take a –2 circumstance penalty to the Thievery check rather than enjoying a bonus. After you attempt such a check with the key the first time, it magically attaches to you, returning to your possession if discarded. To use another device to Pick a Lock, you must first succeed at a DC 20 Will save."
      }
    },
    {
      "name": "Healer's Toolkit",
      "quantity": 1,
      "weight": 1,
      "description": "This kit of bandages, herbs, and suturing tools is necessary for Medicine checks to Administer First Aid, Treat Disease, Treat Poison, or Treat Wounds. If you wear your healer's toolkit, you can draw and replace them as part of the action that uses them."
    },
    {
      "name": "Thieves' Toolkit",
      "quantity": 1,
      "weight": 0.1,
      "description": "You need a thieves' toolkit to Pick Locks or Disable Devices (of some types) using the Thievery skill. If your thieves' toolkit is broken, you can repair it by replacing the lock picks with replacement picks appropriate to your toolkit; this doesn't require using the Repair action. If you wear your thieves' toolkit, you can draw and replace it as part of the action that uses it."
    }
  ],
  "thaumaturge": {
    "passives": [
      {
        "name": "Implement's Empowerment",
        "benefit": "The power of your implement can also be turned to the more common task of combat, its power adding to and amplifying the effects of runes and other magical empowerments. When you Strike, you can trace mystic patterns with an implement you're holding to empower the Strike, causing it to deal 2 additional damage per weapon damage die. Channeling the power requires full use of your hands. You don't gain the benefit of implement's empowerment if you are holding anything in either hand other than a single one-handed weapon, other implements, or esoterica, and you must be holding at least one implement to gain the benefit."
      }
    ],
    "exploits": [
      {
        "name": "Personal Antithesis",
        "description": "You improvise a custom weakness on a creature by forcefully presenting and empowering a piece of esoterica that repels it on an individual level; for instance, against a tyrant, you might procure a broken chain that once held a captive. This causes the target creature, and only the target creature, to gain a weakness against your unarmed and weapon Strikes equal to 2 + half your level."
      },
      {
        "name": "Mortal Weakness",
        "description": "After identifying a creature's weakness, you use a thematically resonant bit of esoterica to attune your attacks to your discovery. Your unarmed and weapon Strikes activate the highest weakness you discovered with Exploit Vulnerability, even though the damage type your weapon deals doesn't change. This damage affects the target of your Exploit Vulnerability, as well as any other creatures of the exact same type, but not other creatures with the same weakness. For example, when fighting a pack of werewolves you might use silver shavings or crushed moonstone to deal damage that applies their weakness to silver to your attacks against any of the werewolves, but you wouldn't apply this damage to any other monsters with a weakness to silver."
      }
    ]
  },
  "actions": [
    {
      "name": "Exploit Vulnerability",
      "actionCount": 1,
      "traits": ["Esoterica", "Manipulate", "Thaumaturge"],
      "description": "You scour your experiences and learning to identify something that might repel your foe. You retrieve an object from your esoterica with the appropriate supernatural qualities, then use your implement to stoke the remnants of its power into a blaze. Select a creature you can see and attempt an Esoteric Lore check against a standard DC for its level, as you retrieve the right object from your esoterica and use your implement to empower it. You gain the following effects until you Exploit Vulnerabilities again.",
      "degrees": {
        "Critical Success": "You remember the creature's weaknesses, and as you empower your esoterica, you have a flash of insight that grants even more knowledge about the creature. You learn all of the creature's resistances, weaknesses, and immunities, including the amounts of the resistances and weaknesses and any unusual weaknesses or vulnerabilities, such as what spells will pass through a golem's antimagic. You can exploit either the creature's mortal weakness or personal antithesis. Your unarmed and weapon Strikes against the creature also become magical if they weren't already.",
        "Success": "You recall an important fact about the creature, learning its highest weakness (or one of its highest weaknesses, if it has multiple with the same value) but not its other weaknesses, resistances, or immunities. You can exploit either the creature's mortal weakness or personal antithesis. Your unarmed and weapon Strikes against the creature also become magical if they weren't already.",
        "Failure": " Failing to recall a salient weakness about the creature, you instead attempt to exploit a more personal vulnerability. You can exploit only the creature's personal antithesis. Your unarmed and weapon Strikes against the creature also become magical if they weren't already.",
        "Critical Failure": "You couldn't remember the right object to use and become distracted while you rummage through your esoterica. You become flat-footed until the beginning of your next turn."
      }
    }
  ],
  "reactions": [],
  "familiar": {
    "name": "Lazarus",
    "type": "Squox",
    "size": "Tiny",
    "traits": ["Familiar"],
    "ac": 19,
    "hp": 15,
    "speed": "25 feet",
    "skills": ["Stealth", "Acrobatics", "Perception"],
    "communication": "Empathic link with Ashka within 1 mile",
    "abilities": [
      {
        "name": "Manual Dexterity",
        "description": "Your familiar can use up to two of its limbs as if they were hands to use manipulate actions."
      },
      {
        "name": "Threat Display",
        "description": "Your familiar helps you convey wordless threats through body language. Whenever you attempt an Intimidation check to Demoralize a creature, if your familiar is within 30 feet of your target and can act, it accompanies you with snarls, hisses, or raising its hackles. If it can do so, you don't take the normal –4 penalty on the Intimidation check if your target doesn't understand the language you're speaking."
      },
      {
        "name": "Squox Tricks",
        "description": "A squox can Disarm and Trip creatures with its tail using Acrobatics instead of Athletics, even if it doesn't have a free hand. A squox can attempt to Disarm or Trip off-guard creatures up to two sizes larger than it and gains a +2 circumstance bonus to the attempt."
      }
    ],
    "description": "A Squox is an exotic creature resembling a cross between a squirrel and a fox. Little is known about them in Golarion, not even where they are native to; the only clue to their origin is the fact that they can most often be tracked back to Elven traders though where they procure the creatures in the first place remains a mystery."
  }
}