{
  "id": "IzzyUncut",
  "created": "2025-04-18T09:00:00.000Z",
  "lastUpdated": "2025-04-18T09:00:00.000Z",
  "name": "Izzy Uncut",
  "ancestry": "Leshy",
  "background": "Celebrity",
  "class": "Bard",
  "level": 3,
  "maxHp": 32,
  "currentHp": 32,
  "ac": 18,
  "size": "Small",
  "speed": 25,
  "abilities": {
    "strength": 10,
    "dexterity": 12,
    "constitution": 14,
    "intelligence": 8,
    "wisdom": 16,
    "charisma": 18
  },
  "saves": {
    "fortitude": 7,
    "reflex": 8,
    "will": 10
  },
  "skills": {
    "deception": {
      "proficiency": 2
    },
    "performance": {
      "proficiency": 1
    },
    "diplomacy": {
      "proficiency": 1
    },
    "nature": {
      "proficiency": 1
    },
    "occultism": {
      "proficiency": 1
    },
    "survival": {
      "proficiency": 1
    }
  },
  "proficiencies": {
  "weapons": {
    "simple": {
      "proficiency": 1,
      "name": "Trained"
    },
    "martial": {
      "proficiency": 1,
      "name": "Trained"
    },
    "advanced": {
      "proficiency": 0,
      "name": "Untrained"
    },
    "unarmed": {
      "proficiency": 1,
      "name": "Trained"
    }
  },
  "armor": {
    "unarmored": {
      "proficiency": 1,
      "name": "Trained"
    },
    "light": {
      "proficiency": 1,
      "name": "Trained"
    },
    "medium": {
      "proficiency": 0,
      "name": "Untrained"
    },
    "heavy": {
      "proficiency": 0,
      "name": "Untrained"
    }
  }
},
"focus_spells":[
      {
        "id": "spell-1",
        "name": "Inspire Courage",
        "level": 0,
        "baseLevel": 1,
        "traits": ["Bard", "Cantrip", "Composition", "Emotion", "Enchantment", "Mental"],
        "actions": "One Action",
        "area": "60-foot emanation",
        "duration": "1 round",
        "description": "You inspire your allies with words or tunes of encouragement. You and all allies in the area gain a +1 status bonus to attack rolls, damage rolls, and saves against fear effects."
      },
      {
        "id": "spell-2",
        "name": "Counter Performance",
        "level": 0,
        "baseLevel": 1,
        "traits": ["Bard", "Composition", "Concentrate", "Focus", "Fortune", "Mental"],
        "actions": "Reaction",
        "trigger": "You or an ally within 60 feet would be affected by an auditory or visual effect.",
        "area": "60-foot emanation",
        "description": "Your performance protects you and your allies. Roll a Performance check for a type you know—it must be an auditory performance if the trigger was auditory or a visual one for a visual trigger, and this action gains the traits for the type of performance (page 243). You and allies in the area can use the better result between your Performance check and the saving throw."
      },
      {
        "id": "spell-3",
        "name": "Hymn of Healing",
        "level": 0,
        "baseLevel": 1,
        "traits": ["Uncommon", "Bard", "Composition", "Concentrate", "Focus", "Healing", "Vitality"],
        "actions": "Two Actions",
        "duration": "sustained up to 4 rounds",
        "area": "30-feet",
        "description": "Your glorious singing mends wounds and provides a temporary respite from harm. The target gains fast healing 2. When you Cast the Spell and the first time each round you Sustain the Spell, the target gains 2 temporary Hit Points, which last for 1 round.",
        "heightened": {
          "+1": "The fast healing and temporary Hit Points each increase by 2."
        }
      }
    ],
  "feats": [
    {
      "id": "feat-1",
      "name": "Celebrity Dedication",
      "level": 2,
      "source": "Archetype",
      "description": "The more people you have looking at you, the more content you are, and you take every opportunity to show up others when their performances are less than perfect. You gain the Upstage reaction. In addition, when you Earn Income, if the level of the task is higher than your level, you gain a +1 circumstance bonus to your check to Earn Income.",
      "reactions":[
        {
          "name": "Upstage",
          "trigger": "An enemy attempts a skill check and doesn’t get a critical success",
          "description": "After your foe has tried their best, you show everyone how it’s really done. Attempt a check using the same skill that triggered this reaction. The DC is typically the same as the check the enemy attempted, though the GM can adjust this as usual.",
          "degrees":{
            "Critical Success": "You gain a +1 status bonus to attack rolls, Perception checks, saving throws, and skill checks until the end of your next turn.",
            "Success": "As critical success, except you gain the benefits only if the triggering creature failed their skill check."
          }
        }
      ]
    },
    {
      "id": "feat-2",
      "name": "Bardic Lore",
      "level": 1,
      "source": "Bard",
      "description": "Your studies cover a wide range of topics. You are trained in Bardic Lore, a special Lore skill that can be used for any checks to Recall Knowledge. If you have legendary proficiency in Occultism, you gain expert proficiency in Bardic Lore, but you can't increase your proficiency rank in Bardic Lore by any other means."
    },
    {
      "id": "feat-3",
      "name": "Seedpod",
      "level": 1,
      "source": "Leshy",
      "description": "Your body produces a nearly endless supply of hard seedpods. You gain a seedpod ranged unarmed attack that deals 1d4 bludgeoning damage; these Strikes have the manipulate trait. On a critical hit, a seedpod bursts, issuing forth a tangle of rapid-growing vines that impose a -10-foot circumstance penalty to the target's Speed for 1 round.",
      "strikes":[
          {
          "name": "Seedpod",
          "proficiency": "unarmed",
          "type": "ranged",
          "action": 1,
          "damage": "1d4",
          "traits": ["Attack", "Ranged"],
          "description": "Chuck one of your seed pods!"
        }
      ]
    },
    {
      "id": "feat-4",
      "name": "Eyes of the City",
      "level": 1,
      "source": "Skill",
      "description": "You can track down targets with the help of locals. You can use Diplomacy or Society, whichever you're trained in, to Track creatures in settlements. You chat with locals to help follow the trail of creatures you Track. At the GM's discretion, there might not be enough people to speak with to keep following the trail."
    },
    {
      "id": "feat-5",
      "name": "Quick Identification",
      "level": 1,
      "source": "Skill",
      "description": "You can Identify Magic swiftly. You take only 1 minute when using Identify Magic to determine the properties of an item, ongoing effect, or location, rather than 10 minutes. If you’re a master, it takes a 3-action activity, and if you’re legendary, it takes 1 action."
    },
    {
      "id": "feat-6",
      "name": "Disrupting Performance",
      "level": 1,
      "source": "Skill",
      "description": "You make an awkward or bizarre sound, note, or gesture to foul the action the creature is attempting. Your reaction gains your choice of the auditory or visual trait. Make a Performance check against the triggering creature's Will DC. Creatures with less than a +0 Intelligence gain a +4 circumstance bonus to their Will DC. Regardless of the outcome, the creature then becomes immune to this reaction for 1 minute.",
      "reactions":[
        {
          "name": "Disrupting Performance",
          "traits": ["Emotion", "General", "Mental", "Skill"],
          "trigger": "A creature you can observe within 30 feet takes a skill action with the Auditory, Concentrate, or Visual traits.",
          "description": "You make an awkward or bizarre sound, note, or gesture to foul the action the creature is attempting. Your reaction gains your choice of the auditory or visual trait. Make a Performance check against the triggering creature's Will DC. Creatures with less than a +0 Intelligence gain a +4 circumstance bonus to their Will DC. Regardless of the outcome, the creature then becomes immune to this reaction for 1 minute."
        }
      ]
    }
  ],
  "inventory": [
    {
      "name": "Gourd Head",
      "quantity": 1,
      "weight": 0.0,
      "description": "You have a large gourd for a skull, and since you don't have a physical brain, you can use the space inside your head. You can store a collection of up to 1 Bulk of objects within your head. The DC of checks to Steal objects from inside your head increases by 4. Additionally, if you store only one object within your head, you can draw it effortlessly into your hand as part of another action to use the object. Drawing the item grants this other action the manipulate trait.",
      "container":{
        "capacity": 1,
        "ignored": 0,
        "contents":[]
      }
    },
    {
      "name": "Backpack",
      "price": 0,
      "quantity": 1,
      "weight": 0.1,
      "description": "A backpack for holding your gear",
      "container":{
        "capacity": 4,
        "ignored": 2,
        "contents":[
          {
            "name": "Bedroll",
            "quantity": 1,
            "weight": 0.1,
            "description": "A compact mat, not too comfy but suitable for long journeys."
          },
          {
            "name": "Chalk",
            "quantity": 10,
            "weight": 0.0,
            "description": "Suitable for marking hard surfaces temporarily."
          },
          {
            "name": "Flint & Steel",
            "quantity": 1,
            "weight": 0.0,
            "description": "A camper's classic for starting fires."
          },
          {
            "name": "Rope (50ft)",
            "quantity": 1,
            "weight": 0.1,
            "description": "Sturdy rope for tying something (or someone) down."
          },
          {
            "name": "Rations",
            "quantity": 7,
            "weight": 0.1,
            "description": "While they don't taste amazing, rations offer enough nutrition to keep you from starving. Each pack can feed a single person for a day."
          },
          {
            "name": "Soap",
            "quantity": 1,
            "weight": 0.0,
            "description": "Scrub a dub dub"
          },
          {
            "name": "Torch",
            "quantity": 5,
            "weight": 0.1,
            "description": "A torch sheds bright light in a 20-foot radius (and dim light to the next 20 feet) for 1 hour. It can be used as an improvised weapon that deals 1d4 bludgeoning damage plus 1 fire damage when lit."
          },
          {
            "name": "Waterskin",
            "quantity": 1,
            "weight": 0.1,
            "description": "When it's full, a waterskin contains roughly 1 day's worth of water for a Small or Medium creature."
          }
        ]
      }
    },
    {
      "id": "item-1",
      "name": "Vocoder of Invisibility",
      "quantity": 1,
      "weight": 1.0,
      "description": "A curious device found in a crashed spaceship in the deserts of Numeria.",
      "traits": ["Magical"],
      "actions":[
        {
          "name": "Unseen Din",
          "actionCount": 1,
          "traits": ["Illusion", "Manipulate", "Sonic"],
          "description": "You engage a piece of the alien technology, producing a deafening sound as you become completely invisible. Because of the noise, you are only Concealed to other creatures unless they are deaf. This effect lasts until the end of your next turn."
        }
      ]
    },
    {
      "id": "item-2",
      "name": "Studded Leather Armor",
      "quantity": 1,
      "weight": 1.0,
      "description": "This leather armor is reinforced with metal studs and sometimes small metal plates, providing most of the flexibility of leather armor with more robust protection."
    },
    {
      "id": "item-5",
      "name": "Minor Healing Potion",
      "quantity": 1,
      "weight": 0.1,
      "traits": ["Consumable", "Healing", "Magical", "Potion", "Vitality"],
      "description": "A healing potion is a vial of a ruby-red liquid that imparts a tingling sensation as the drinker's wounds heal rapidly. When you drink a minor healing potion, it restores 1d8 HP when consumed"
    },
    {
      "name": "Scroll of Friendfetch",
      "quantity": 1,
      "weight": 1.0,
      "description": "A single-use scroll",
      "traits": ["Consumable", "Magical", "Scroll"],
      "scroll":{
        "name": "Friendfetch",
        "level": 1,
        "traits": ["Uncommon", "Force"],
        "actions": "Two Actions",
        "range": "30 feet",
        "targets": "1 or 2 willing creatures",
        "description": "You shoot out ephemeral, telekinetic strands that drag each target directly toward you, stopping in the closest unoccupied space to you in this path. This is forced movement."
      }
    },
    {
      "name": "Scroll of Cleanse Affliction",
      "quantity": 1,
      "weight": 1.0,
      "description": "A single-use scroll",
      "traits": ["Consumable", "Magical", "Scroll"],
      "scroll":{
        "name": "Cleanse Affliction",
        "level": 2,
        "traits": ["Concentrate", "Healing", "Manipulate"],
        "actions": "Two Actions",
        "range": "Touch",
        "targets": "1 willing creature",
        "description": "Gentle restorative magic pushes back the effects of toxins and more complex maladies. Choose an affliction on the target, such as a curse, disease, or poison. If it has advanced past stage one, reduce the stage by one. This reduction can be applied only once to a given case of an affliction, with the case ending when it's completely cured. Although the reduction can't occur again, heightened versions of this spell attempt to counteract with each casting.",
        "heightened":{
          "3rd": "Attempt to counteract the affliction if it is a disease or poison.",
          "5th": "Attempt to counteract the affliction if it is a curse, disease, or poison."
        }
      }
    },
    {
      "name": "Sanitizing Pin",
      "price": 7,
      "quantity": 1,
      "weight": 0,
      "traits": ["Consumable", "Magical", "Talisman", "Uncommon"],
      "description": "This pin includes a piece of gauze wrapped around a dried herbal poultice. When you activate the sanitizing pin, the poultice dissolves and bolsters your body's defense against poison or disease. You gain a +2 status bonus on your Fortitude save against the initial exposure to the affliction. If you roll a critical failure on the triggering attempt, you get a failure instead."
    },
    {
      "name": "Rust Scrub",
      "price": 2,
      "quantity": 1,
      "weight": 0.1,
      "traits": ["Alchemical", "Consumable", "Uncommon"],
      "description": "This salt scrub is infused with citron juice and alchemical ingredients that allow it to fight rust on metallic equipment. One application can be used to restore 2d4 Hit Points to an item that has been damaged by rust. The GM determines what portion of damage to an item was caused by rust if that value isn't known."
    }
  ],
  "spellcasting": {
    "tradition": "Occult",
    "ability": "charisma",
    "proficiency": 2,
    "focus": {
      "max": 2,
      "current": 1
    },
    "spells": [
      {
        "id": "spell-3",
        "name": "Daze",
        "level": 0,
        "baseLevel": 1,
        "traits": ["Cantrip", "Concentrate", "Manipulate", "Mental", "Nonlethal"],
        "actions": "Two Actions",
        "range": "60 feet",
        "targets": "1 creature",
        "defense": "Will",
        "description": "You cloud the target's mind and daze it with a mental jolt. The jolt deals 1d6 mental damage; the target must attempt a basic Will save. If the target critically fails the save, it is also stunned 1."
      },
      {
        "id": "spell-4",
        "name": "Forbidding Ward",
        "level": 0,
        "baseLevel": 1,
        "traits": ["Cantrip","Concentrate","Manipulate"],
        "actions": "Two Actions",
        "range": "30 feet",
        "targets": "1 ally and 1 enemy",
        "duration": "Sustained up to 1 minute",
        "description": "You ward an ally against the attacks and hostile spells from the target enemy. The target ally gains a +1 status bonus to Armor Class and saving throws against the target enemy's attacks, spells, and other effects.",
        "heightened":{
          "6th": "The status bonus increases to +2."
        }
      },
      {
        "id": "spell-5",
        "name": "Guidance",
        "level": 0,
        "baseLevel": 1,
        "traits": ["Cantrip", "Concentrate"],
        "actions": "One Action",
        "range": "30 feet",
        "targets": "1 creature",
        "duration": "Until the start of your next turn",
        "description": "You ask for the guidance of supernatural entities, granting the target a +1 status bonus to one attack roll, Perception check, saving throw, or skill check the target attempts before the duration ends. The target chooses which roll to use the bonus on before rolling. If the target uses the bonus, the spell ends. Either way, the target is then temporarily immune for 1 hour."
      },
      {
        "id": "spell-6",
        "name": "Shield",
        "level": 0,
        "baseLevel": 1,
        "traits": ["Cantrip", "Concentrate", "Force"],
        "actions": "One Action",
        "duration": "Until the start of your next turn",
        "description": "You raise a magical shield of force. This counts as using the Raise a Shield action, giving you a +1 circumstance bonus to AC until the start of your next turn, but it doesn't require a hand to use. While the spell is in effect, you can use the Shield Block reaction with your magical shield. The shield has Hardness 5. You can use the spell's reaction to reduce damage from any spell or magical effect, even if it doesn't deal physical damage. After you use Shield Block, the spell ends and you can't cast it again for 10 minutes.",
        "heightened": {
          "+2": "The shields hardness increases by 5."
        }
      },
      {
        "name": "Haunting Hymn",
        "level": 0,
        "baseLevel": 1,
        "traits": ["Auditory", "Cantrip", "Concentrate", "Manipulate", "Sonic"],
        "actions": "Two Actions",
        "area": "15-foot cone",
        "defense":"Fortitude",
        "description": "You echo a jarring hymn that only creatures in the area can hear. The hymn deals 1d8 sonic damage, with a basic Fortitude save. If a target critically fails the save, it's also deafened for 1 minute.",
        "heightened": {
          "+2": "The damage increases by 1d8."
        }
      },
      {
        "id": "spell-7",
        "name": "Summon Undead",
        "level": 1,
        "traits": ["Concentrate", "Manipulate", "Summon"],
        "actions": "Two Actions",
        "range": "30 feet",
        "duration": "Sustained up to 1 minute",
        "description": "You summon a creature that has the undead trait and whose level is –1 to fight for you.",
        "heightened":{
          "2nd": "The creature can be up to Level 1.",
          "3rd": "The creature can be up to Level 2.",
          "4th": "The creature can be up to Level 3.",
          "5th": "The creature can be up to Level 5.",
          "6th": "The creature can be up to Level 7.",
          "7th": "The creature can be up to Level 9.",
          "8th": "The creature can be up to Level 11.",
          "9th": "The creature can be up to Level 13.",
          "10th": "The creature can be up to Level 15."
        }
      },
      {
        "id": "spell-8",
        "name": "Bless",
        "level": 1,
        "traits": ["Aura", "Concentrate", "Manipulate", "Mental"],
        "actions": "Two Actions",
        "area": "15-foot emanation",
        "duration": "1 minute",
        "description": "Blessings from beyond help your companions strike true. You and your allies gain a +1 status bonus to attack rolls while within the emanation. Once per round on subsequent turns, you can Sustain the spell to increase the emanation's radius by 10 feet. Bless can counteract bane."
      },
      {
        "id": "spell-9",
        "name": "Fear",
        "level": 1,
        "traits": ["Concentrate", "Emotion", "Fear", "Manipulate", "Mental"],
        "actions": "Two Actions",
        "range": "30 feet",
        "targets": "1 creature",
        "defense": "Will",
        "description": "You plant fear in the target; it must attempt a Will save.",
        "heightened": {
          "3rd": "You can target up to five creatures."
        },
        "degrees": {
          "Critical Success": "The target is unaffected.",
          "Success": "The target is frightened 1.",
          "Failure": "The target is frightened 2.",
          "Critical Failure": "The target is frightened 3 and fleeing for 1 round."
        }
      },
      {
        "id": "spell-11",
        "name": "Charitable Urge",
        "level": 2,
        "traits": ["Concentrate", "Incapacitation", "Manipulate", "Mental"],
        "actions": "Two Actions",
        "range": "30 feet",
        "targets": "1 creature",
        "defense": "Will",
        "duration": "Varies",
        "description": "You speak on the virtue of charity, compelling the target to give away its possessions. The target must attempt a Will save. If the target has no items on its person, the spell fails.",
        "degrees": {
          "Critical Success": "The target is unaffected.",
          "Success": "The target is stunned 1 as it wrestles with the urge.",
          "Failure": "On its next turn, before it does anything else, the target must present the nearest creature with an item in its possession; the target chooses which item to give, and if the only item it has is one that it's currently using to defend itself, such as a weapon during a combat encounter, it can choose to be stunned for 1 round instead of giving up the item. This might require the target to Interact to retrieve an item or move to reach the nearest creature, and passing the item off requires an Interact action as normal.",
          "Critical Failure": "As failure, except the duration is 4 rounds, and the target must repeat the effects of a failure on each of its turns. At the end of each of its turns, the target can attempt a new Will save to reduce the remaining duration by 1 round, ending the effects entirely on a critical success."
        }
      },
      {
        "id": "spell-12",
        "name": "Noise Blast",
        "level": 2,
        "traits": ["Concentrate", "Manipulate", "Sonic"],
        "actions": "Two Actions",
        "range": "60 feet",
        "area": "20-foot burst",
        "defense": "Fortitude",
        "description": "A cacophonous noise blasts out, dealing 2d10 sonic damage. Each creature must attempt a Fortitude save.",
        "heightened": {
          "+1": "The damage increases by 1d10."
        },
        "degrees":{
          "Critical Success": "The target is unaffected.",
          "Success": "The target takes half damage.",
          "Failure": "The target takes full damage and is Deafened for 1 round  ",
          "Critical Failure": "The creature takes double damage and is deafened for 1 minute, and stunned 1."
        }
      }
    ]
  },
  "strikes":[
    {
      "name": "Unarmed Strike",
      "proficiency": "unarmed",
      "type": "melee",
      "action": 1,
      "damage": "1d4",
      "traits": ["Attack", "Melee"],
      "description": "Give 'em a good smack"
    }
  ]
}