{
  "id": "IzzyUncut",
  "created": "2025-04-18T09:00:00.000Z",
  "lastUpdated": "2025-04-18T09:00:00.000Z",
  "name": "Izzy Uncut",
  "ancestry": "Leshy",
  "background": "Entertainer",
  "class": "Bard",
  "level": 3,
  "maxHp": 32,
  "currentHp": 32,
  "ac": 18,
  "abilities": {
    "strength": 10,
    "dexterity": 12,
    "constitution": 14,
    "intelligence": 8,
    "wisdom": 16,
    "charisma": 18
  },
  "saves": {
    "fortitude": 7,
    "reflex": 8,
    "will": 10
  },
  "skills": {
    "deception": {
      "proficiency": 2
    },
    "performance": {
      "proficiency": 1
    },
    "diplomacy": {
      "proficiency": 1
    },
    "nature": {
      "proficiency": 1
    },
    "occultism": {
      "proficiency": 1
    },
    "survival": {
      "proficiency": 1
    }
  },
  "proficiencies": {
  "weapons": {
    "simple": {
      "proficiency": 1,
      "name": "Trained"
    },
    "martial": {
      "proficiency": 1,
      "name": "Trained"
    },
    "advanced": {
      "proficiency": 0,
      "name": "Untrained"
    },
    "unarmed": {
      "proficiency": 1,
      "name": "Trained"
    }
  },
  "armor": {
    "unarmored": {
      "proficiency": 1,
      "name": "Trained"
    },
    "light": {
      "proficiency": 1,
      "name": "Trained"
    },
    "medium": {
      "proficiency": 0,
      "name": "Untrained"
    },
    "heavy": {
      "proficiency": 0,
      "name": "Untrained"
    }
  }
},
"focus_spells":[
      {
        "id": "spell-1",
        "name": "Inspire Courage",
        "level": 0,
        "traits": ["Bard", "Cantrip", "Composition", "Emotion", "Enchantment", "Mental"],
        "actions": "One Action",
        "area": "60-foot emanation",
        "duration": "1 round",
        "description": "You inspire your allies with words or tunes of encouragement. You and all allies in the area gain a +1 status bonus to attack rolls, damage rolls, and saves against fear effects."
      },
      {
        "id": "spell-2",
        "name": "Counter Performance",
        "level": 0,
        "traits": ["Bard", "Cantrip", "Composition", "Enchantment", "Fortune", "Mental"],
        "actions": "Reaction",
        "trigger": "You or an ally within 60 feet would be affected by an auditory or visual effect.",
        "area": "60-foot emanation",
        "description": "You use your performance to counter a sonic or visual effect. Roll a Performance check; if your performance is instrumental, you gain a +2 circumstance bonus against auditory effects, and if your performance is a visual display, you gain a +2 circumstance bonus against visual effects. You can counter both types with a combination performance, but you don't gain a circumstance bonus."
      }
    ],
  "feats": [
    {
      "id": "feat-1",
      "name": "Celebrity Dedication",
      "level": 2,
      "source": "Archetype",
      "description": "You've developed a significant following due to your artistic talents. You become trained in Society. If you were already trained in Society, you instead become trained in a skill of your choice. You also become trained in Celebrity Lore. You can use your proficiency rank in Performance in place of your proficiency rank in Diplomacy when Gathering Information or Making an Impression."
    },
    {
      "id": "feat-2",
      "name": "Bardic Lore",
      "level": 1,
      "source": "Bard",
      "description": "Your studies cover a wide range of topics. You are trained in Bardic Lore, a special Lore skill that can be used for any checks to Recall Knowledge. If you have legendary proficiency in Occultism, you gain expert proficiency in Bardic Lore, but you can't increase your proficiency rank in Bardic Lore by any other means."
    },
    {
      "id": "feat-3",
      "name": "Seedpod",
      "level": 1,
      "source": "Leshy",
      "description": "Your body produces a nearly endless supply of hard seedpods. You gain a seedpod ranged unarmed attack that deals 1d4 bludgeoning damage; these Strikes have the manipulate trait. On a critical hit, a seedpod bursts, issuing forth a tangle of rapid-growing vines that impose a -10-foot circumstance penalty to the target's Speed for 1 round."
    },
    {
      "id": "feat-4",
      "name": "Eyes of the City",
      "level": 1,
      "source": "Skill",
      "description": "You keep in contact with various people in the local settlement, and you have a finger on its pulse. You know what's going on and who's involved with what around you. When you're in a settlement, if you succeed at a normal check to Gather Information or Recall Knowledge about that settlement, you get one additional piece of information or relevant fact. If you critically succeed, you get two additional pieces of information or relevant facts."
    },
    {
      "id": "feat-5",
      "name": "Quick Identification",
      "level": 1,
      "source": "Skill",
      "description": "You can Identify Magic after examining an item for only 1 minute (rather than 10 minutes). If you're a master in Arcana, Nature, Occultism, or Religion, you can Identify Magic in that tradition after examining an item for only 3 rounds. If you're legendary, it takes 1 round."
    },
    {
      "id": "feat-6",
      "name": "Disrupting Performance",
      "level": 1,
      "source": "Skill",
      "description": "You make an awkward or bizarre sound, note, or gesture to foul the action the creature is attempting. Your reaction gains your choice of the auditory or visual trait. Make a Performance check against the triggering creature's Will DC. Creatures with less than a +0 Intelligence gain a +4 circumstance bonus to their Will DC. Regardless of the outcome, the creature then becomes immune to this reaction for 1 minute."
    }
  ],
  "inventory": [
    {
      "id": "item-1",
      "name": "Resonant Mandolin",
      "quantity": 1,
      "weight": 1.0,
      "description": "Serves as a spellcasting focus and performance instrument"
    },
    {
      "id": "item-2",
      "name": "Leather Armor",
      "quantity": 1,
      "weight": 2.0,
      "description": ""
    },
    {
      "id": "item-3",
      "name": "Rapier",
      "quantity": 1,
      "weight": 1.0,
      "description": ""
    },
    {
      "id": "item-4",
      "name": "Adventurer's Pack",
      "quantity": 1,
      "weight": 2.0,
      "description": "Includes backpack, bedroll, 10 pieces of chalk, flint and steel, 50 feet of rope, 2 weeks' rations, soap, 5 torches, and a waterskin"
    },
    {
      "id": "item-5",
      "name": "Minor Healing Potion",
      "quantity": 2,
      "weight": 0.1,
      "description": "Restores 1d8 HP when consumed"
    }
  ],
  "spellcasting": {
    "tradition": "Occult",
    "ability": "charisma",
    "proficiency": 2,
    "focus": {
      "max": 1,
      "current": 1
    },
    "spells": [
      {
        "id": "spell-3",
        "name": "Daze",
        "level": 0,
        "traits": ["Cantrip", "Enchantment", "Mental", "Nonlethal"],
        "actions": "Two Actions",
        "range": "60 feet",
        "targets": "1 creature",
        "defense": "Will",
        "description": "You cloud the target's mind and daze it with a mental jolt. The jolt deals 1d6 mental damage; the target must attempt a basic Will save. If the target critically fails the save, it is also stunned 1."
      },
      {
        "id": "spell-4",
        "name": "Forbidding Ward",
        "level": 0,
        "traits": ["Abjuration", "Cantrip"],
        "actions": "Two Actions",
        "range": "30 feet",
        "targets": "1 ally and 1 enemy",
        "duration": "Until the start of your next turn",
        "description": "You ward an ally against the attacks and hostile spells from the target enemy. The target ally gains a +1 status bonus to Armor Class and saving throws against the target enemy's attacks, spells, and other effects."
      },
      {
        "id": "spell-5",
        "name": "Guidance",
        "level": 0,
        "traits": ["Cantrip", "Divination"],
        "actions": "One Action",
        "range": "30 feet",
        "targets": "1 creature",
        "duration": "Until the start of your next turn",
        "description": "You provide divine guidance, granting the target a +1 status bonus to one attack roll, Perception check, saving throw, or skill check the target attempts before the duration ends. The target chooses which roll to use the bonus on before rolling. If the target uses the bonus, the spell ends. Either way, the target is temporarily immune for 1 hour."
      },
      {
        "id": "spell-6",
        "name": "Shield",
        "level": 0,
        "traits": ["Abjuration", "Cantrip", "Force"],
        "actions": "One Action",
        "duration": "Until the start of your next turn",
        "description": "You raise a magical shield of force. This counts as using the Raise a Shield action, giving you a +1 circumstance bonus to AC until the start of your next turn, but it doesn't require a hand to use. While the spell is in effect, you can use the Shield Block reaction with your magical shield."
      },
      {
        "id": "spell-7",
        "name": "Animate Dead",
        "level": 1,
        "traits": ["Necromancy"],
        "actions": "Two Actions",
        "range": "30 feet",
        "targets": "1 corpse",
        "duration": "Sustained up to 1 minute",
        "description": "You temporarily animate a corpse to fight for you. The corpse becomes a mindless undead creature. If the corpse was previously animated, you can instead extend the duration of your control over it for the duration of this spell. The animated corpse acts on your next turn and has 4 actions each turn that it remains animated."
      },
      {
        "id": "spell-8",
        "name": "Bless",
        "level": 1,
        "traits": ["Enchantment", "Mental"],
        "actions": "Two Actions",
        "area": "5-foot emanation",
        "duration": "1 minute",
        "description": "Blessings from beyond help your allies strike true. You and your allies gain a +1 status bonus to attack rolls while within the emanation. The first time each round a new ally enters the area, the spell's emanation increases by 5 feet."
      },
      {
        "id": "spell-9",
        "name": "Fear",
        "level": 1,
        "traits": ["Emotion", "Enchantment", "Fear", "Mental"],
        "actions": "Two Actions",
        "range": "30 feet",
        "targets": "1 creature",
        "defense": "Will",
        "description": "You plant fear in the target; it must attempt a Will save. On a critical success, the target is unaffected. On a success, the target is frightened 1. On a failure, the target is frightened 2. On a critical failure, the target is frightened 3 and fleeing for 1 round.",
        "heightened": {
          "3rd": "You can target up to five creatures."
        }
      },
      {
        "id": "spell-10",
        "name": "Magic Missile",
        "level": 1,
        "traits": ["Evocation", "Force"],
        "actions": "One to Three Actions",
        "range": "120 feet",
        "targets": "1 creature",
        "description": "You send a dart of force streaking toward a creature that you can see. It automatically hits and deals 1d4+1 force damage. For each additional action you use when Casting the Spell, you can fire an additional missile at the same or a different target.",
        "heightened": {
          "+2": "You fire one additional missile with each action you spend."
        }
      },
      {
        "id": "spell-11",
        "name": "Charitable Urge",
        "level": 2,
        "traits": ["Enchantment", "Incapacitation", "Mental"],
        "actions": "Two Actions",
        "range": "30 feet",
        "targets": "1 creature",
        "defense": "Will",
        "duration": "Varies",
        "description": "You implant a charitable urge in the target's mind. The target must attempt a Will save. If the target has no action or reaction available when it fails its save, it is affected for an equal amount of time after it regains actions."
      },
      {
        "id": "spell-12",
        "name": "Noise Blast",
        "level": 2,
        "traits": ["Evocation", "Sonic"],
        "actions": "Two Actions",
        "range": "60 feet",
        "area": "20-foot burst",
        "defense": "Fortitude",
        "description": "A scintillating array of sounds tears through the minds of your enemies. Targets must attempt a Fortitude save and take 2d8 sonic damage. On a critical success, they are unaffected. On a success, they take half damage. On a failure, they take full damage and are deafened for 1 round. On a critical failure, they take double damage and are deafened for 4 rounds.",
        "heightened": {
          "+1": "The damage increases by 1d8."
        }
      }
    ]
  }
}