{
  "id": "Pellias",
  "name": "Pellias",
  "ancestry": "Human",
  "background": "Kineticist",
  "class": "Champion",
  "level": 4,
  "maxHp": 60,
  "ac": 22,
  "size": "Medium",
  "speed": 20,
  "abilities": {
    "strength": 18,
    "dexterity": 10,
    "constitution": 16,
    "intelligence": 10,
    "wisdom": 12,
    "charisma": 12
  },
  "saves": {
    "fortitude": 11,
    "reflex": 6,
    "will": 9
  },
  "skills": {
    "athletics": {
      "proficiency": 2
    },
    "diplomacy": {
      "proficiency": 1
    },
    "intimidation": {
      "proficiency": 1
    },
    "nature": {
      "proficiency": 1
    },
    "perception": {
      "proficiency":1
    },
    "religion": {
      "proficiency": 1
    },
    "survival":{
      "proficiency": 1
    }
  },
  "proficiencies": {
    "weapons": {
      "simple": {
        "proficiency": 1,
        "name": "Trained"
      },
      "martial": {
        "proficiency": 1,
        "name": "Trained"
      },
      "advanced": {
        "proficiency": 0,
        "name": "Untrained"
      },
      "unarmed": {
        "proficiency": 1,
        "name": "Trained"
      }
    },
    "armor": {
      "unarmored": {
        "proficiency": 1,
        "name": "Trained"
      },
      "light": {
        "proficiency": 1,
        "name": "Trained"
      },
      "medium": {
        "proficiency": 1,
        "name": "Trained"
      },
      "heavy": {
        "proficiency": 1,
        "name": "Trained"
      }
    }
  },
  "feats": [
    {
      "id": "feat-1",
      "name": "Kineticist Dedication",
      "level": 2,
      "source": "Archetype",
      "description": "You gain the ability to gather and shape elemental energy. Choose an element: air, earth, fire, metal, water, or wood. You gain an impulse attack with the element trait from a gate of your choice.",
      "actions": [
        {
          "name": "Channel Elements",
          "actionCount": 1,
          "traits": ["Aura", "Kineticist", "Metal", "Primal"],
          "description": "You tap into your kinetic gate to make elements flow around you. Your kinetic aura activates, and as a part of this action, you can use a 1-action Elemental Blast or a 1-action stance impulse. Your kinetic aura is a 10-foot emanation where pieces of your kinetic element (or all your kinetic elements, if you can channel more than one) flow around you. The kinetic aura can't damage anything or affect the environment around you unless another ability allows it to. Channel Elements has the traits of all your kinetic elements.\nYour kinetic aura automatically deactivates if you're knocked out, you use an impulse with the overflow trait, or you Dismiss the aura. Though you can't use new impulses while your kinetic aura is deactivated, ones you already used remain, and you can still Sustain any that can be sustained. Stance impulses are linked to your kinetic aura and end when the aura deactivates."
        }
      ],
      "strikes":[
        {
          "name": "Melee Metal Blast",
          "actionCount": "One to Two",
          "type": "melee",
          "traits": ["Attack", "Impulse", "Kineticist", "Metal", "Primal"],
          "damage": "1d8",
          "description": "With a wave of your hand, you collect shards of metal from your aura and swing or hurl it. Make a melee or ranged impulse attack against the AC of one creature. Add your Strength modifier to the damage roll for a melee Elemental Blast. If you make a 2-action Elemental Blast, you gain a status bonus to the damage roll equal to your Constitution modifier. Your blast does piercing or slashing damage."
        },
        {
          "name": "Ranged Metal Blast",
          "actionCount": "One to Two",
          "type": "ranged",
          "damage": "1d8",
          "range": "30ft",
          "traits": ["Attack", "Impulse", "Kineticist", "Metal", "Primal"],
          "description": "With a wave of your hand, you collect shards of metal from your aura and swing or hurl it. Make a melee or ranged impulse attack against the AC of one creature. Add your Strength modifier to the damage roll for a melee Elemental Blast. When you make a 2-action Elemental Blast, you gain a status bonus to the damage roll equal to your Constitution modifier. Your blast does piercing or slashing damage, and has a range of 30 feet."
        }
      ]
    },
    {
      "id": "feat-2",
      "name": "Deity's Domain",
      "level": 1,
      "source": "Champion",
      "description": "You embody an aspect of your deity. You get the initial domain spell of the Metal domain as a Devotion Spell."
    },
    {
      "id": "feat-3",
      "name": "Devoted Guardian",
      "level": 2,
      "source": "Champion",
      "description": "You adopt a wide stance, ready to defend both yourself and your chosen ward.",
      "actions": [
        {
          "name": "Devoted Guardian",
          "actionCount": 1,
          "traits": ["Champion"],
          "description": "You adopt a wide stance, ready to defend both yourself and your chosen ward. Select one adjacent creature. As long as your shield is raised and the creature remains adjacent to you, the creature gains a +1 circumstance bonus to their AC, or a +2 circumstance bonus if the shield you raised was a tower shield."
        }
      ]
    },
    {
      "id": "feat-4",
      "name": "Nimble Reprisal",
      "level": 2,
      "source": "Ancestry",
      "description": "You can use Retributive Strike at greater distance. You can use a ranged weapon to make a ranged Strike instead of a melee Strike for Retributive Strike. The enemy needs to be in range, but not in reach, and it must still be in your champion's aura. You can also make melee Strikes against enemies a bit farther away. If the enemy that triggered your reaction is outside your reach but is within 5 feet of your reach, as part of your reaction you can Step to put the enemy in your reach before making a melee Retributive Strike."
    },
    {
      "id": "feat-5",
      "name": "Shield Block",
      "level": 1,
      "source": "General",
      "description": "You snap your shield in place to ward off a blow. You immediately use your shield's Hardness to reduce the damage you would take by that amount. Your shield takes the damage that was prevented in this way instead."
    },
    {
      "id": "feat-6",
      "name": "Untrained Improvisation",
      "level": 3,
      "source": "General",
      "description": "You've learned how to handle situations when you're out of your depth. Your proficiency bonus to untrained skill checks is equal to half your level instead of +0. If you're 7th level or higher, the bonus increases to your full level instead."
    },
    {
      "id": "feat-7",
      "name": "Natural Ambition",
      "level": 1,
      "source": "Human",
      "description": "Your ambition knows no bounds, and you strive to learn as much as you can. You gain an extra 1st-level class feat."
    },
    {
      "id": "feat-8",
      "name": "Hefty Hauler",
      "level": 2,
      "source": "General",
      "description": "You can carry more than your frame implies. Increase your maximum Bulk by 2 and your encumbered Bulk by 2."
    },
    {
      "id": "feat-9",
      "name": "Hobnobber",
      "level": 1,
      "source": "Skill",
      "description": "You are skilled at learning information through conversation. The Gather Information exploration activity takes you half as long as normal (typically 1 hour instead of 2)."
    },
    {
      "id": "feat-10",
      "name": "Titan Wrestler",
      "level": 1,
      "source": "Skill",
      "description": "You can attempt to Disarm, Grapple, Shove, or Trip creatures up to two sizes larger than you, and you don't take a circumstance penalty when targeting a creature that's one size larger than you with these actions."
    },
    {
      "id": "feat-11",
      "name": "Primary Threat",
      "level": 4,
      "source": "Champion",
      "description": "When a fight begins, you make it clear you should be the one people are concerned about.",
      "freeActions": [
        {
          "name": "Primary Threat",
          "traits": [ "Champion"],
          "trigger": "Your turn begins and it is the first round of combat",
          "description": "You Delay while presenting an imposing afront to your enemies. Enemy creatures that go after you used Delay take a -1 circumstance penalty to attack rolls against your allies until the beginning of your next turn. Creatures can remove this penalty by spending a single action with the concentrate trait to do their own threat evaluation."
        }
      ]
    },
    {
      "id": "feat-12",
      "name": "Through the Gate",
      "level": 4,
      "source": "Kineticist",
      "description": "You have learned to channel the energies of the Plane of Metal more precisely; you gain a new Kineticist Impulse.",
      "actions": [
        {
          "name": "Shard Strike",
          "actionCount": 2,
          "traits": ["Impulse", "Kineticist", "Metal", "Primal"],
          "description": "Jagged metal shards form in the air and lash out in front of you. Creatures in the area attempt a Basic Reflex Save against your Class DC. Choose Shards or Spines. Shards deal 1d6 slashing damage in a 15-foot cone, and a creature that critically fails takes 1d6 persistent bleed damage. Spines deal 1d6 piercing damage in a 30-foot line, and a creature that critically fails is Clumsy 1 until the start of your next turn."
        }
      ]
    },
    {
      "id": "feat-13",
      "name": "Murmured Prayer",
      "level": 4,
      "source": "Skill",
      "description": "A prayer under your breath to the appropriate god can guide you in times of trouble. You can cast Guidance as a divine innate cantrip. Once per day, you can utter a prayer to a particularly relevant deity as part of casting Guidance, and the bonus increases to a +2. You do not need to follow the deity to ask for their guidance, but if their goals do not align with you own, they may refuse to aid you. When you are Legendary in Religion, you can utter a prayer once per hour instead of daily."
    }
  ],
  "inventory": [
    {
      "id": "item-1",
      "name": "Full Plate",
      "traits": ["Bulwark"],
      "quantity": 1,
      "weight": 4.0,
      "speedPenalty": [10, 5],
      "description": "Plate mail consists of interlocking plates that encase nearly the entire body in a carapace of steel. It is costly and heavy, and the wearer often requires help to don it correctly, but it provides some of the best defense armor can supply. A suit of this armor comes with an undercoat of padded armor and a pair of gauntlets."
    },
    {
      "name": "Spiked Steel Shield",
      "quantity": 1,
      "weight": 1,
      "description": "Like wooden shields, steel shields come in a variety of shapes and sizes. Though more expensive than wooden shields, they are much more durable.",
      "shield": {
        "health": 20,
        "breakThreshold": 10,
        "hardness": 5,
        "bonus": 2
      },
      "strikes": {
        "name": "Spiked Shield Bash",
        "proficiency": "simple",
        "type": "melee",
        "action": 1,
        "damage": "1d6",
        "traits": ["Attack", "melee"]
      }
    },
    {
      "name": "Tower Shield",
      "quantity": 1,
      "weight": 4,
      "description": "These massive shields can be used to provide cover to nearly the entire body. Due to their size, they are typically made of wood reinforced with metal. You provide cover for allies behind you when you raise a tower shield, and can increase the bonus to AC from +2 to +4 by Taking Cover after Raising the shield.",
      "shield": {
        "health": 20,
        "breakThreshold": 10,
        "hardness": 5,
        "bonus": 2,
        "speedPenalty": 5
      }
      
    },
    {
      "name": "+1 Cold Iron Light Hammer",
      "potency": 1,
      "weight": 1,
      "quantity": 1,
      "traits": ["Agile", "Thrown 20ft"],
      "description": "This smaller version of the warhammer has a wooden or metal shaft ending in a metal head. Unlike its heavier cousin, it is light enough to throw. Cold iron weapons deal additional damage to creatures with weakness to cold iron, like demons and fey.",
      "strikes": [
        {
          "name": "Light Hammer Strike",
          "proficiency": "martial",
          "type": "melee",
          "action": 1,
          "damage": "1d6",
          "traits": ["Attack", "Agile", "Melee"]
        },
        {
          "name": "Hammer Throw",
          "proficiency": "martial",
          "type": "ranged",
          "range": "20ft",
          "action": 1,
          "damage": "1d6",
          "traits": ["Attack", "Agile", "Thrown"]
        }
      ]
    },
    {
      "name": "Sanitizing Pin",
      "price": 7,
      "quantity": 1,
      "weight": 0,
      "traits": ["Consumable", "Magical", "Talisman", "Uncommon"],
      "description": "This pin includes a piece of gauze wrapped around a dried herbal poultice. When you activate the sanitizing pin, the poultice dissolves and bolsters your body's defense against poison or disease. You gain a +2 status bonus on your Fortitude save against the initial exposure to the affliction. If you roll a critical failure on the triggering attempt, you get a failure instead."
    },
    {
      "name": "Rust Scrub",
      "price": 2,
      "quantity": 1,
      "weight": 0.1,
      "traits": ["Alchemical", "Consumable", "Uncommon"],
      "description": "This salt scrub is infused with citron juice and alchemical ingredients that allow it to fight rust on metallic equipment. One application can be used to restore 2d4 Hit Points to an item that has been damaged by rust. The GM determines what portion of damage to an item was caused by rust if that value isn't known."
    },
    {
      "name": "Minor Elixir of Life",
      "price": 3,
      "quantity": 1,
      "weight": 0.1,
      "traits": ["Alchemical", "Consumable", "Elixir", "Healing"],
      "description": "Elixirs of life accelerate a living creature's natural healing processes and immune system. Upon drinking this elixir, you regain 1d6 Hit Points and gain a +1 item bonus to saving throws against diseases and poisons for 10 minutes."
    },
    {
      "name": "Gecko Potion",
      "price": 3,
      "quantity": 1,
      "weight": 0.1,
      "traits": ["Consumable", "Magical", "Potion"],
      "description": "A gecko potion is a sticky, tawny brown liquid with flecks of sand suspended in it. For 5 minutes after drinking this potion, your fingertips sprout thousands of microscopic, bristled hairs that cling to objects, granting you a +1 item bonus to Climb and Palm an Object, and to your Reflex DC against Disarm attempts."
    },
    {
      "name": "Wolf Fang",
      "price": 3,
      "quantity": 1,
      "weight": 0.0,
      "traits": ["Consumable", "Magical", "Talisman"],
      "description": "This wolf canine is bound in a strip of leather and tied to a buckle or strap on a suit of armor. When the fang is affixed to a weapon and you succesfully trip a foe, you can activate it to deal bludgeoning damage equal to your Strength modifier to the target of your Trip."
    },
    {
      "name": "Backpack",
      "price": 0,
      "quantity": 1,
      "weight": 0.1,
      "description": "A backpack for holding your gear",
      "container":{
        "capacity": 4,
        "ignored": 2,
        "contents":[
          {
            "name": "Bedroll",
            "quantity": 1,
            "weight": 0.1,
            "description": "A compact mat, not too comfy but suitable for long journeys."
          },
          {
            "name": "Chalk",
            "quantity": 10,
            "weight": 0.0,
            "description": "Suitable for marking hard surfaces temporarily."
          },
          {
            "name": "Flint & Steel",
            "quantity": 1,
            "weight": 0.0,
            "description": "A camper's classic for starting fires."
          },
          {
            "name": "Rope (50ft)",
            "quantity": 1,
            "weight": 0.1,
            "description": "Sturdy rope for tying something (or someone) down."
          },
          {
            "name": "Rations",
            "quantity": 7,
            "weight": 0.1,
            "description": "While they don't taste amazing, rations offer enough nutrition to keep you from starving. Each pack can feed a single person for a day."
          },
          {
            "name": "Soap",
            "quantity": 1,
            "weight": 0.0,
            "description": "Scrub a dub dub"
          },
          {
            "name": "Torch",
            "quantity": 5,
            "weight": 0.1,
            "description": "A torch sheds bright light in a 20-foot radius (and dim light to the next 20 feet) for 1 hour. It can be used as an improvised weapon that deals 1d4 bludgeoning damage plus 1 fire damage when lit."
          },
          {
            "name": "Waterskin",
            "quantity": 1,
            "weight": 0.1,
            "description": "When it's full, a waterskin contains roughly 1 day's worth of water for a Small or Medium creature."
          },
          {
            "name": "+1 Striking Pick",
            "weight": 1,
            "quantity": 1,
            "potency": 1,
            "description": "A pick designed solely for combat has a sturdy wooden shaft and a heavy, pointed head to deliver devastating blows.",
            "traits": ["Fatal 1d10"],
            "strikes": {
              "proficiency": "martial",
              "type": "melee",
              "action": 1,
              "damage": "2d6"
            }
          }
        ]
      }
    }
  ],
  "champion": {
    "deity": "Ferrumnestra",
    "cause": "Paladin",
    "tenets": [
      "You must act with honor, never cheating, lying, or taking advantage of others.",
      "You must respect legitimate authority.",
      "You must act with mercy, showing compassion to those who deserve it and seeking to convert those who don't to goodness.",
      "You must be righteous, standing against the forces of evil wherever they might hide."
    ],
    "devotion_spells": [
      {
        "id": "spell-1",
        "name": "Serrate",
        "level": 1,
        "baseLevel": 1,
        "traits": ["Uncommon","Champion", "Focus", "Manipulate", "Metal"],
        "actions": "One Action",
        "range": "Touch",
        "targets": "1 metal weapon",
        "description": "With a pinch, the metal of a weapon twists, adding numerous jagged blades along its surface. Strikes with the target weapon deal an additional 1d4 slashing damage until the start of your next turn.",
        "heightened": {
            "+2": "The extra damage increases by 1d4."
          }
      },
      {
        "id": "spell-2",
        "name": "Shields of the Spirit",
        "level": 1,
        "baseLevel": 1,
        "traits": ["Uncommon","Champion","Concentrate", "Focus", "Sanctified", "Spirit"],
        "actions": "One Action",
        "requirements": "You are wielding a shield.",
        "description": "You Raise your Shield, causing ephemeral spirit shields to float within your champion's aura. The shields last until the start of your next turn or until you're no longer raising your shield, whichever comes first. While one of your allies is in your champion's aura, the shields grant them a +1 status bonus to AC, and each time an enemy makes an attack against the ally, the enemy takes 1d4 spirit damage (even if it misses).\nThe benefit applies only while an ally is in your aura, ending for any ally that leaves and applying to any that enters later. As normal, you don't count as your own ally and therefore don't get the benefits of the spirit shields yourself.",
        "heightened": {
            "+2": "The extra damage increases by 1d4."
          }
      },
      {
        "id": "spell-3",
        "name": "Guidance",
        "level": 1,
        "baseLevel": 1,
        "traits": ["Cantrip","Concentrate"],
        "actions": "One Action",
        "range": "30ft",
        "description": "You ask for the guidance of supernatural entities, granting the target a +1 status bonus to one attack roll, Perception check, saving throw, or skill check the target attempts before the start of your next turn. The target chooses which roll to use the bonus on before rolling. If the target uses the bonus, the spell ends. Either way, they are immune to further Guidance for 1 hour."
      }
    ],
    "focus_points": 2,
    "class_dc": 19
  },
  "strikes": [ 
    {
      "name": "Unarmed Strike",
      "proficiency": "unarmed",
      "type": "melee",
      "action": 1,
      "damage": "1d4",
      "traits": ["Attack", "Melee"],
      "description": "Give 'em a good smack"
    }
   ],
  "actions": [],
  "reactions": [
    {
      "name": "Retributive Strike",
      "traits": ["Champion"],
      "trigger": "An enemy damages an ally within 15 feet of you.",
      "description": "You protect your ally and strike your foe. The ally gains resistance to all damage against the triggering damage equal to 2 + your level. If the foe is within reach, make a melee Strike against it."
    },
    {
      "name": "Shield Block",
      "traits": ["General"],
      "trigger": "While you have your shield raised, you take damage from a physical attack.",
      "description": "You position your shield to ward off a blow. Your shield prevents you from taking an amount of damage up to the shield's Hardness. You and the shield each take any remaining damage, possibly breaking or destroying the shield."
    }
  ],
  "freeActions": []
}