{
  "id": "Pellias",
  "name": "Pellias",
  "ancestry": "Human",
  "background": "Squire",
  "class": "Champion",
  "level": 3,
  "maxHp": 47,
  "ac": 21,
  "abilities": {
    "strength": 18,
    "dexterity": 10,
    "constitution": 16,
    "intelligence": 10,
    "wisdom": 12,
    "charisma": 12
  },
  "saves": {
    "fortitude": 10,
    "reflex": 5,
    "will": 8
  },
  "skills": {
    "athletics": {
      "proficiency": 2
    },
    "diplomacy": {
      "proficiency": 1
    },
    "intimidation": {
      "proficiency": 1
    },
    "nature": {
      "proficiency": 1
    },
    "religion": {
      "proficiency": 1
    }
  },
  "proficiencies": {
    "weapons": {
      "simple": {
        "proficiency": 1,
        "name": "Trained"
      },
      "martial": {
        "proficiency": 1,
        "name": "Trained"
      },
      "advanced": {
        "proficiency": 0,
        "name": "Untrained"
      },
      "unarmed": {
        "proficiency": 1,
        "name": "Trained"
      }
    },
    "armor": {
      "unarmored": {
        "proficiency": 1,
        "name": "Trained"
      },
      "light": {
        "proficiency": 1,
        "name": "Trained"
      },
      "medium": {
        "proficiency": 1,
        "name": "Trained"
      },
      "heavy": {
        "proficiency": 1,
        "name": "Trained"
      }
    }
  },
  "feats": [
    {
      "id": "feat-1",
      "name": "Kineticist Dedication",
      "level": 1,
      "source": "Archetype",
      "description": "You gain the ability to gather and shape elemental energy. Choose an element: air, earth, fire, metal, water, or wood. You gain an impulse attack with the element trait from a gate of your choice."
    },
    {
      "id": "feat-2",
      "name": "Deity's Domain",
      "level": 1,
      "source": "Champion",
      "description": "You embody an aspect of your deity. Choose one of your deity's domains from the list in their entry. You gain the domain's initial domain spell as a devotion spell."
    },
    {
      "id": "feat-3",
      "name": "Devoted Guardian",
      "level": 1,
      "source": "Champion",
      "description": "You've sworn to protect your allies with your shield. When you use the Shield Block reaction to protect an ally, if the ally takes any damage from the attack, you can reduce the damage they take by 2 + your level, and you increase the damage your shield takes by the same amount."
    },
    {
      "id": "feat-4",
      "name": "Nimble Reprisal",
      "level": 2,
      "source": "Ancestry",
      "description": "If an enemy misses you with a melee attack, you can use your reaction to Step away from that enemy. The enemy must remain within your reach throughout your Step to use this reaction."
    },
    {
      "id": "feat-5",
      "name": "Shield Block",
      "level": 1,
      "source": "General",
      "description": "You snap your shield in place to ward off a blow. You immediately use your shield's Hardness to reduce the damage you would take by that amount. Your shield takes the damage that was prevented in this way instead."
    },
    {
      "id": "feat-6",
      "name": "Untrained Improvisation",
      "level": 3,
      "source": "General",
      "description": "You've learned how to handle situations when you're out of your depth. Your proficiency bonus to untrained skill checks is equal to half your level instead of +0. If you're 7th level or higher, the bonus increases to your full level instead."
    },
    {
      "id": "feat-7",
      "name": "Natural Ambition",
      "level": 1,
      "source": "Human",
      "description": "Your ambition knows no bounds, and you strive to learn as much as you can. You gain a 1st-level class feat."
    },
    {
      "id": "feat-8",
      "name": "Hefty Hauler",
      "level": 1,
      "source": "General",
      "description": "You can carry more than your frame implies. Increase your maximum Bulk by 2 and your encumbered Bulk by 2."
    },
    {
      "id": "feat-9",
      "name": "Hobnobber",
      "level": 1,
      "source": "Skill",
      "description": "You are skilled at learning information through conversation. The Gather Information exploration activity takes you half as long as normal (typically 1 hour instead of 2)."
    },
    {
      "id": "feat-10",
      "name": "Titan Wrestler",
      "level": 1,
      "source": "Skill",
      "description": "You can attempt to Disarm, Grapple, Shove, or Trip creatures up to two sizes larger than you, and you don't take a circumstance penalty when targeting a creature that's one size larger than you with these actions."
    }
  ],
  "inventory": [
    {
      "id": "item-1",
      "name": "Full Plate",
      "quantity": 1,
      "weight": 4.0,
      "description": "Heavy armor that provides excellent protection at the cost of mobility."
    },
    {
      "id": "item-2",
      "name": "Steel Shield (Sturdy, Minor)",
      "quantity": 1,
      "weight": 1.0,
      "description": "A reinforced shield that can absorb more damage before breaking. Hardness 8, HP 64, BT 32"
    },
    {
      "id": "item-3",
      "name": "Longsword (+1)",
      "quantity": 1,
      "weight": 1.0,
      "description": "A versatile blade that can be wielded with one or two hands. This sword has been magically enhanced to strike more accurately."
    },
    {
      "id": "item-4",
      "name": "Holy Symbol",
      "quantity": 1,
      "weight": 0.1,
      "description": "A silver symbol of Iomedae, the goddess of righteous valor, honor, and justice."
    },
    {
      "id": "item-5",
      "name": "Healer's Tools",
      "quantity": 1,
      "weight": 1.0,
      "description": "These bandages, herbs, and suturing tools are necessary for Medicine checks to Treat Wounds."
    },
    {
      "id": "item-6",
      "name": "Potion of Healing (Minor)",
      "quantity": 3,
      "weight": 0.1,
      "description": "Restores 1d8 HP when consumed."
    },
    {
      "id": "item-7",
      "name": "Adventurer's Pack",
      "quantity": 1,
      "weight": 2.0,
      "description": "Includes backpack, bedroll, 10 pieces of chalk, flint and steel, 50 feet of rope, 2 weeks' rations, soap, 5 torches, and a waterskin."
    }
  ],
  "champion": {
    "deity": "Iomedae",
    "cause": "Paladin (Good)",
    "alignment": "Lawful Good",
    "tenets": [
      "You must act with honor, never cheating, lying, or taking advantage of others.",
      "You must respect legitimate authority.",
      "You must act with mercy, showing compassion to those who deserve it and seeking to convert those who don't to goodness.",
      "You must be righteous, standing against the forces of evil wherever they might hide."
    ],
    "devotion_spells": [
      {
        "id": "spell-1",
        "name": "Serrate",
        "level": 1,
        "traits": ["Uncommon","Champion", "Focus", "Manipulate", "Metal"],
        "actions": "One Action",
        "range": "Touch",
        "targets": "1 metal weapon",
        "description": "With a pinch, the metal of a weapon twists, adding numerous jagged blades along its surface. Strikes with the target weapon deal an additional 1d4 slashing damage until the start of your next turn.",
        "heightened": {
            "+2": "The extra damage increases by 1d4."
          }
      },
      {
        "id": "spell-2",
        "name": "Shields of the Spirit",
        "level": 2,
        "traits": ["Uncommon","Champion","Concentrate", "Focus", "Sanctified", "Spirit"],
        "actions": "One Action",
        "requirements": "You are wielding a shield.",
        "description": "You Raise your Shield, causing ephemeral spirit shields to float within your champion's aura. The shields last until the start of your next turn or until you're no longer raising your shield, whichever comes first. While one of your allies is in your champion's aura, the shields grant them a +1 status bonus to AC, and each time an enemy makes an attack against the ally, the enemy takes 1d4 spirit damage (even if it misses).\nThe benefit applies only while an ally is in your aura, ending for any ally that leaves and applying to any that enters later. As normal, you don't count as your own ally and therefore don't get the benefits of the spirit shields yourself.",
        "heightened": {
            "+2": "The extra damage increases by 1d4."
          }
      }
    ],
    "reactions": [
      {
        "name": "Retributive Strike",
        "trigger": "An enemy damages an ally within 15 feet of you.",
        "description": "You protect your ally and strike your foe. The ally gains resistance to all damage against the triggering damage equal to 2 + your level. If the foe is within reach, make a melee Strike against it."
      },
      {
        "name": "Shield Block",
        "trigger": "While you have your shield raised, you take damage from a physical attack.",
        "description": "You position your shield to ward off a blow. Your shield prevents you from taking an amount of damage up to the shield's Hardness. You and the shield each take any remaining damage, possibly breaking or destroying the shield."
      }
    ],
    "focus_points": 1,
    "class_dc": 19
  }
}