{
  "id": "sample-character-2",
  "created": "2025-04-18T14:30:00.000Z",
  "lastUpdated": "2025-04-18T14:30:00.000Z",
  "name": "Ashka B'Gosh",
  "ancestry": "Fetchling",
  "background": "Emissary",
  "class": "Thaumaturge",
  "level": 3,
  "maxHp": 32,
  "currentHp": 32,
  "ac": 19,
  "abilities": {
    "strength": 10,
    "dexterity": 16,
    "constitution": 10,
    "intelligence": 12,
    "wisdom": 12,
    "charisma": 18
  },
  "saves": {
    "fortitude": 7,
    "reflex": 10,
    "will": 8
  },
  "skills": {
    "acrobatics": {
      "proficiency": 1
    },
    "arcana": {
      "proficiency": 1
    },
    "deception": {
      "proficiency": 2
    },
    "diplomacy": {
      "proficiency": 1
    },
    "medicine": {
      "proficiency": 1
    },
    "nature": {
      "proficiency": 1
    },
    "occultism": {
      "proficiency": 1
    },
    "religion": {
      "proficiency": 1
    },
    "stealth": {
      "proficiency": 1
    },
    "survival": {
      "proficiency": 1
    },
    "thievery": {
      "proficiency": 1
    }
  },
  "feats": [
    {
      "id": "feat-1",
      "name": "Shadow Magic",
      "level": 1,
      "source": "Fetchling",
      "description": "The shadow magic of the Shadow Plane flows through you. You can cast the dancing lights cantrip as an occult innate spell at will. In addition, you can cast 1st-level darkness once per day as an occult innate spell."
    },
    {
      "id": "feat-2",
      "name": "Implement's Empowerment",
      "level": 1,
      "source": "Thaumaturge",
      "description": "When you use your implement to affect a creature that you've identified with Recall Knowledge, you gain a +1 circumstance bonus to your attack roll or save DC. If you got a critical success on the Recall Knowledge check, this bonus increases to +2."
    },
    {
      "id": "feat-3",
      "name": "Diverse Lore",
      "level": 2,
      "source": "Thaumaturge",
      "description": "You collect information from a wide variety of sources, letting you use your esoterica lore for a wider range of topics. You can use your esoterica lore to Recall Knowledge about any topic, though you still can't use it in place of a specific lore for a task that requires specialized training, such as Crafting."
    }
  ],
  "inventory": [
    {
      "id": "item-1",
      "name": "Amulet Implement",
      "quantity": 1,
      "weight": 0.1,
      "description": "A darkwood amulet carved with shadow symbols"
    },
    {
      "id": "item-2",
      "name": "Rapier",
      "quantity": 1,
      "weight": 1.0,
      "description": "Piercing damage, finesse, deadly d8"
    },
    {
      "id": "item-3",
      "name": "Leather Armor",
      "quantity": 1,
      "weight": 2.0,
      "description": "Light armor, +2 AC, +4 DEX Cap, -1 Check Penalty"
    },
    {
      "id": "item-4",
      "name": "Adventurer's Pack",
      "quantity": 1,
      "weight": 2.0,
      "description": "Includes backpack, bedroll, 10 pieces of chalk, flint and steel, 50 feet of rope, 2 weeks' rations, soap, 5 torches, and a waterskin"
    },
    {
      "id": "item-5",
      "name": "Scroll of Comprehend Language",
      "quantity": 2,
      "weight": 0.1,
      "description": "Allows comprehension of an unfamiliar language for 1 hour"
    },
    {
      "id": "item-6",
      "name": "Chalice Implement",
      "quantity": 1,
      "weight": 0.5,
      "description": "An obsidian chalice with silver inlaid runes"
    },
    {
      "id": "item-7",
      "name": "Esoteric Tome",
      "quantity": 1,
      "weight": 1.0,
      "description": "Contains notes on various creatures and their weaknesses"
    }
  ],
  "notes": [
    {
      "id": "note-1",
      "title": "Shadow Plane Research",
      "date": "2025-04-10",
      "content": "I've been collecting information about the intersection points between our world and the Shadow Plane. There seems to be a pattern to the locations where the veil is thinnest. Most align with ancient sites of occult significance.",
      "createdAt": "2025-04-10T18:45:00.000Z"
    },
    {
      "id": "note-2",
      "title": "Amulet's Strange Behavior",
      "date": "2025-04-15",
      "content": "My amulet implement has been behaving oddly when near the northern temple ruins. The symbols glow with a faint purple light, and I've noticed shadows cast by it seem to move independently. Could be connected to the strange occurrences the villagers reported.",
      "createdAt": "2025-04-15T21:30:00.000Z"
    }
  ],
  "thaumaturge": {
    "implements": [
      {
        "name": "Amulet",
        "benefit": "You gain an item bonus to saving throws equal to the amulet's implement bonus.",
        "esoterica": "You gain a +1 circumstance bonus to Perception checks to sense magic and to Recall Knowledge about magical subjects."
      },
      {
        "name": "Chalice",
        "benefit": "As an action, you can imbue the chalice with a concoction that you or an adjacent ally can drink. This grants temporary Hit Points equal to your level + your Charisma modifier that last for 10 minutes.",
        "esoterica": "When you succeed at identifying a creature, you learn about any special characteristics of its physiology."
      }
    ],
    "exploits": [
      {
        "name": "Personal Antithesis",
        "description": "You learn how to find and exploit a weakness in a specific creature. When you use Exploit Vulnerability against a creature you've identified with Recall Knowledge, you gain a +2 circumstance bonus to damage rolls against that creature."
      },
      {
        "name": "Shadow Shroud",
        "description": "You can manipulate shadows around yourself, gaining a +1 circumstance bonus to Stealth checks and concealment against creatures more than 30 feet away from you in dim light or darkness."
      }
    ],
    "paradigm": "Cursed",
    "paradigm_description": "You believe that many supernatural effects, including those that creatures create, are curses, whether they manifest as traditional curses, possessions, or simple maledictions. You know that using a creature's personal possessions against them lets you take advantage of the metaphysical connection between creature and possession."
  }
}